lsbeatz/esp32c6-fw/drivers/timg/timg_regs.h
// Do not edit: This file is automatically generated
// hash: 1e408066979383add4a7f19aea10488046b68ddf623614ba31273149fe41e425
// description: Timer Group(TIMG)

#ifndef TIMG_REGS_H
#define TIMG_REGS_H

#include <stdint.h>

/* clang-format off */

//Register Offsets

#define TIMG_T0CONFIG_OFS       ( 0x0000UL ) // Timer 0 configuration register
#define TIMG_T0LO_OFS           ( 0x0004UL ) // Timer 0 current value, low 32 bits
#define TIMG_T0HI_OFS           ( 0x0008UL ) // Timer 0 current value, high 22 bits
#define TIMG_T0UPDATE_OFS       ( 0x000CUL ) // Write to copy current timer value to TIMGn_T0LO_REG or TIMGn_T0HI_REG
#define TIMG_T0ALARMLO_OFS      ( 0x0010UL ) // Timer 0 alarm value, low 32 bits
#define TIMG_T0ALARMHI_OFS      ( 0x0014UL ) // Timer 0 alarm value, high bits
#define TIMG_T0LOADLO_OFS       ( 0x0018UL ) // Timer 0 reload value, low 32 bits
#define TIMG_T0LOADHI_OFS       ( 0x001CUL ) // Timer 0 reload value, high 22 bits
#define TIMG_T0LOAD_OFS         ( 0x0020UL ) // Write to reload timer from TIMG_T0LOADLO_REG or TIMG_T0LOADHI_REG
#define TIMG_WDTCONFIG0_OFS     ( 0x0048UL ) // Watchdog timer configuration register
#define TIMG_WDTCONFIG1_OFS     ( 0x004CUL ) // Watchdog timer prescaler register
#define TIMG_WDTCONFIG2_OFS     ( 0x0050UL ) // Watchdog timer stage 0 timeout value
#define TIMG_WDTCONFIG3_OFS     ( 0x0054UL ) // Watchdog timer stage 1 timeout value
#define TIMG_WDTCONFIG4_OFS     ( 0x0058UL ) // Watchdog timer stage 2 timeout value
#define TIMG_WDTCONFIG5_OFS     ( 0x005CUL ) // Watchdog timer stage 3 timeout value
#define TIMG_WDTFEED_OFS        ( 0x0060UL ) // Write to feed the watchdog timer
#define TIMG_WDTWPROTECT_OFS    ( 0x0064UL ) // Watchdog write protect register
#define TIMG_RTCCALICFG0_OFS    ( 0x0068UL ) // RTC frequency calculation configuration register 0
#define TIMG_RTCCALICFG1_OFS    ( 0x006CUL ) // RTC frequency calculation configuration register 1
#define TIMG_RTCCALICFG2_OFS    ( 0x0080UL ) // RTC frequency calculation configuration register 2
#define TIMG_INT_ENA_TIMERS_OFS ( 0x0070UL ) // Interrupt enable bits
#define TIMG_INT_RAW_TIMERS_OFS ( 0x0074UL ) // Raw interrupt status
#define TIMG_INT_ST_TIMERS_OFS  ( 0x0078UL ) // Masked interrupt status
#define TIMG_INT_CLR_TIMERS_OFS ( 0x007CUL ) // Interrupt clear bits
#define TIMG_NTIMERS_DATE_OFS   ( 0x00F8UL ) // Timer version control register
#define TIMG_REGCLK_OFS         ( 0x00FCUL ) // Timer group clock gate register

// Register REGs

#define TIMG_T0CONFIG_REG(base)       ( (base) + (TIMG_T0CONFIG_OFS)       )
#define TIMG_T0LO_REG(base)           ( (base) + (TIMG_T0LO_OFS)           )
#define TIMG_T0HI_REG(base)           ( (base) + (TIMG_T0HI_OFS)           )
#define TIMG_T0UPDATE_REG(base)       ( (base) + (TIMG_T0UPDATE_OFS)       )
#define TIMG_T0ALARMLO_REG(base)      ( (base) + (TIMG_T0ALARMLO_OFS)      )
#define TIMG_T0ALARMHI_REG(base)      ( (base) + (TIMG_T0ALARMHI_OFS)      )
#define TIMG_T0LOADLO_REG(base)       ( (base) + (TIMG_T0LOADLO_OFS)       )
#define TIMG_T0LOADHI_REG(base)       ( (base) + (TIMG_T0LOADHI_OFS)       )
#define TIMG_T0LOAD_REG(base)         ( (base) + (TIMG_T0LOAD_OFS)         )
#define TIMG_WDTCONFIG0_REG(base)     ( (base) + (TIMG_WDTCONFIG0_OFS)     )
#define TIMG_WDTCONFIG1_REG(base)     ( (base) + (TIMG_WDTCONFIG1_OFS)     )
#define TIMG_WDTCONFIG2_REG(base)     ( (base) + (TIMG_WDTCONFIG2_OFS)     )
#define TIMG_WDTCONFIG3_REG(base)     ( (base) + (TIMG_WDTCONFIG3_OFS)     )
#define TIMG_WDTCONFIG4_REG(base)     ( (base) + (TIMG_WDTCONFIG4_OFS)     )
#define TIMG_WDTCONFIG5_REG(base)     ( (base) + (TIMG_WDTCONFIG5_OFS)     )
#define TIMG_WDTFEED_REG(base)        ( (base) + (TIMG_WDTFEED_OFS)        )
#define TIMG_WDTWPROTECT_REG(base)    ( (base) + (TIMG_WDTWPROTECT_OFS)    )
#define TIMG_RTCCALICFG0_REG(base)    ( (base) + (TIMG_RTCCALICFG0_OFS)    )
#define TIMG_RTCCALICFG1_REG(base)    ( (base) + (TIMG_RTCCALICFG1_OFS)    )
#define TIMG_RTCCALICFG2_REG(base)    ( (base) + (TIMG_RTCCALICFG2_OFS)    )
#define TIMG_INT_ENA_TIMERS_REG(base) ( (base) + (TIMG_INT_ENA_TIMERS_OFS) )
#define TIMG_INT_RAW_TIMERS_REG(base) ( (base) + (TIMG_INT_RAW_TIMERS_OFS) )
#define TIMG_INT_ST_TIMERS_REG(base)  ( (base) + (TIMG_INT_ST_TIMERS_OFS)  )
#define TIMG_INT_CLR_TIMERS_REG(base) ( (base) + (TIMG_INT_CLR_TIMERS_OFS) )
#define TIMG_NTIMERS_DATE_REG(base)   ( (base) + (TIMG_NTIMERS_DATE_OFS)   )
#define TIMG_REGCLK_REG(base)         ( (base) + (TIMG_REGCLK_OFS)         )

// Register Bits

// TIMG_T0CONFIG
#define TIMG_T0CONFIG_DESC "Timer 0 configuration register"

#ifndef __ASSEMBLY__

union timg_t0config {
	uint32_t raw;

	struct {
		uint32_t rsvd0      : 10;
		uint32_t alarm_en   : 1;
		uint32_t divcnt_rst : 1;
		uint32_t rsvd1      : 1;
		uint32_t divider    : 16;
		uint32_t autoreload : 1;
		uint32_t increase   : 1;
		uint32_t en         : 1;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0CONFIG_ALARM_EN_DESC       "Configures whether or not to enable the timer 0 alarm function. This bit will be automatically cleared once an alarm occurs."
#define TIMG_T0CONFIG_ALARM_EN_SHIFT      ( 10 )
#define TIMG_T0CONFIG_ALARM_EN_MASK       ( 0x00000400 )
#define TIMG_T0CONFIG_ALARM_EN_VALUE(raw) ( ((raw) & (TIMG_T0CONFIG_ALARM_EN_MASK)) >> (TIMG_T0CONFIG_ALARM_EN_SHIFT) )
#define TIMG_T0CONFIG_ALARM_EN_RAW(value) ( (value) << (TIMG_T0CONFIG_ALARM_EN_SHIFT) )

#define TIMG_T0CONFIG_DIVCNT_RST_DESC       "Configures whether or not to reset the timer 0 ’s clock divider counter."
#define TIMG_T0CONFIG_DIVCNT_RST_SHIFT      ( 11 )
#define TIMG_T0CONFIG_DIVCNT_RST_MASK       ( 0x00000800 )
#define TIMG_T0CONFIG_DIVCNT_RST_VALUE(raw) ( ((raw) & (TIMG_T0CONFIG_DIVCNT_RST_MASK)) >> (TIMG_T0CONFIG_DIVCNT_RST_SHIFT) )
#define TIMG_T0CONFIG_DIVCNT_RST_RAW(value) ( (value) << (TIMG_T0CONFIG_DIVCNT_RST_SHIFT) )

#define TIMG_T0CONFIG_DIVIDER_DESC       "Represents the timer 0 clock (T0_clk) prescaler value."
#define TIMG_T0CONFIG_DIVIDER_SHIFT      ( 13 )
#define TIMG_T0CONFIG_DIVIDER_MASK       ( 0x1FFFE000 )
#define TIMG_T0CONFIG_DIVIDER_VALUE(raw) ( ((raw) & (TIMG_T0CONFIG_DIVIDER_MASK)) >> (TIMG_T0CONFIG_DIVIDER_SHIFT) )
#define TIMG_T0CONFIG_DIVIDER_RAW(value) ( (value) << (TIMG_T0CONFIG_DIVIDER_SHIFT) )

#define TIMG_T0CONFIG_AUTORELOAD_DESC       "Configures whether or not to enable the timer 0 auto-reload function at the time of alarm."
#define TIMG_T0CONFIG_AUTORELOAD_SHIFT      ( 29 )
#define TIMG_T0CONFIG_AUTORELOAD_MASK       ( 0x20000000 )
#define TIMG_T0CONFIG_AUTORELOAD_VALUE(raw) ( ((raw) & (TIMG_T0CONFIG_AUTORELOAD_MASK)) >> (TIMG_T0CONFIG_AUTORELOAD_SHIFT) )
#define TIMG_T0CONFIG_AUTORELOAD_RAW(value) ( (value) << (TIMG_T0CONFIG_AUTORELOAD_SHIFT) )

#define TIMG_T0CONFIG_INCREASE_DESC       "Configures the counting direction of the timer 0 time-base counter."
#define TIMG_T0CONFIG_INCREASE_SHIFT      ( 30 )
#define TIMG_T0CONFIG_INCREASE_MASK       ( 0x40000000 )
#define TIMG_T0CONFIG_INCREASE_VALUE(raw) ( ((raw) & (TIMG_T0CONFIG_INCREASE_MASK)) >> (TIMG_T0CONFIG_INCREASE_SHIFT) )
#define TIMG_T0CONFIG_INCREASE_RAW(value) ( (value) << (TIMG_T0CONFIG_INCREASE_SHIFT) )

#define TIMG_T0CONFIG_EN_DESC       "Configures whether or not to enable the timer 0 time-base counter."
#define TIMG_T0CONFIG_EN_SHIFT      ( 31 )
#define TIMG_T0CONFIG_EN_MASK       ( 0x80000000 )
#define TIMG_T0CONFIG_EN_VALUE(raw) ( ((raw) & (TIMG_T0CONFIG_EN_MASK)) >> (TIMG_T0CONFIG_EN_SHIFT) )
#define TIMG_T0CONFIG_EN_RAW(value) ( (value) << (TIMG_T0CONFIG_EN_SHIFT) )

// TIMG_T0LO
#define TIMG_T0LO_DESC "Timer 0 current value, low 32 bits"

