lsbeatz/esp32c6-fw/drivers/timg/timg_regs.h
#ifndef __ASSEMBLY__

union timg_t0lo {
	uint32_t raw;

	struct {
		uint32_t lo : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0LO_LO_DESC       "Represents the low 32 bits of the time-base counter of timer 0. Valid only after writing to TIMG_T0UPDATE_REG. Measurement unit: T0_clk"
#define TIMG_T0LO_LO_SHIFT      ( 0 )
#define TIMG_T0LO_LO_MASK       ( 0xFFFFFFFF )
#define TIMG_T0LO_LO_VALUE(raw) ( ((raw) & (TIMG_T0LO_LO_MASK)) >> (TIMG_T0LO_LO_SHIFT) )
#define TIMG_T0LO_LO_RAW(value) ( (value) << (TIMG_T0LO_LO_SHIFT) )

// TIMG_T0HI
#define TIMG_T0HI_DESC "Timer 0 current value, high 22 bits"

#ifndef __ASSEMBLY__

union timg_t0hi {
	uint32_t raw;

	struct {
		uint32_t hi    : 22;
		uint32_t rsvd0 : 10;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0HI_HI_DESC       "Represents the high 22 bits of the time-base counter of timer 0. Valid only after writing to TIMG_T0UPDATE_REG. Measurement unit: T0_clk."
#define TIMG_T0HI_HI_SHIFT      ( 0 )
#define TIMG_T0HI_HI_MASK       ( 0x003FFFFF )
#define TIMG_T0HI_HI_VALUE(raw) ( ((raw) & (TIMG_T0HI_HI_MASK)) >> (TIMG_T0HI_HI_SHIFT) )
#define TIMG_T0HI_HI_RAW(value) ( (value) << (TIMG_T0HI_HI_SHIFT) )

// TIMG_T0UPDATE
#define TIMG_T0UPDATE_DESC "Write to copy current timer value to TIMGn_T0LO_REG or TIMGn_T0HI_REG"

#ifndef __ASSEMBLY__

union timg_t0update {
	uint32_t raw;

	struct {
		uint32_t rsvd0  : 31;
		uint32_t update : 1;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0UPDATE_UPDATE_DESC       "Configures to latch the counter value."
#define TIMG_T0UPDATE_UPDATE_SHIFT      ( 31 )
#define TIMG_T0UPDATE_UPDATE_MASK       ( 0x80000000 )
#define TIMG_T0UPDATE_UPDATE_VALUE(raw) ( ((raw) & (TIMG_T0UPDATE_UPDATE_MASK)) >> (TIMG_T0UPDATE_UPDATE_SHIFT) )
#define TIMG_T0UPDATE_UPDATE_RAW(value) ( (value) << (TIMG_T0UPDATE_UPDATE_SHIFT) )

// TIMG_T0ALARMLO
#define TIMG_T0ALARMLO_DESC "Timer 0 alarm value, low 32 bits"

#ifndef __ASSEMBLY__

union timg_t0alarmlo {
	uint32_t raw;

	struct {
		uint32_t lo : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0ALARMLO_LO_DESC       "Configures the low 32 bits of timer 0 alarm trigger time-base counter value. Valid only when TIMG_T0_ALARM_EN is 1. Measurement unit: T0_clk."
#define TIMG_T0ALARMLO_LO_SHIFT      ( 0 )
#define TIMG_T0ALARMLO_LO_MASK       ( 0xFFFFFFFF )
#define TIMG_T0ALARMLO_LO_VALUE(raw) ( ((raw) & (TIMG_T0ALARMLO_LO_MASK)) >> (TIMG_T0ALARMLO_LO_SHIFT) )
#define TIMG_T0ALARMLO_LO_RAW(value) ( (value) << (TIMG_T0ALARMLO_LO_SHIFT) )

// TIMG_T0ALARMHI
#define TIMG_T0ALARMHI_DESC "Timer 0 alarm value, high bits"

#ifndef __ASSEMBLY__

union timg_t0alarmhi {
	uint32_t raw;

	struct {
		uint32_t hi    : 22;
		uint32_t rsvd0 : 10;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0ALARMHI_HI_DESC       "Configures the high 22 bits of timer 0 alarm trigger time-base counter value. Valid only when TIMG_T0_ALARM_EN is 1. Measurement unit: T0_clk."
#define TIMG_T0ALARMHI_HI_SHIFT      ( 0 )
#define TIMG_T0ALARMHI_HI_MASK       ( 0x003FFFFF )
#define TIMG_T0ALARMHI_HI_VALUE(raw) ( ((raw) & (TIMG_T0ALARMHI_HI_MASK)) >> (TIMG_T0ALARMHI_HI_SHIFT) )
#define TIMG_T0ALARMHI_HI_RAW(value) ( (value) << (TIMG_T0ALARMHI_HI_SHIFT) )

// TIMG_T0LOADLO
#define TIMG_T0LOADLO_DESC "Timer 0 reload value, low 32 bits"

#ifndef __ASSEMBLY__

union timg_t0loadlo {
	uint32_t raw;

	struct {
		uint32_t lo : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0LOADLO_LO_DESC       "Configures low 32 bits of the value that a reload will load onto timer 0 time-base counter. Measurement unit: T0_clk."
#define TIMG_T0LOADLO_LO_SHIFT      ( 0 )
#define TIMG_T0LOADLO_LO_MASK       ( 0xFFFFFFFF )
#define TIMG_T0LOADLO_LO_VALUE(raw) ( ((raw) & (TIMG_T0LOADLO_LO_MASK)) >> (TIMG_T0LOADLO_LO_SHIFT) )
#define TIMG_T0LOADLO_LO_RAW(value) ( (value) << (TIMG_T0LOADLO_LO_SHIFT) )

// TIMG_T0LOADHI
#define TIMG_T0LOADHI_DESC "Timer 0 reload value, high 22 bits"

#ifndef __ASSEMBLY__

union timg_t0loadhi {
	uint32_t raw;

	struct {
		uint32_t hi    : 22;
		uint32_t rsvd0 : 10;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0LOADHI_HI_DESC       "Configures high 22 bits of the value that a reload will load onto timer 0 time-base counter. Measurement unit: T0_clk."
#define TIMG_T0LOADHI_HI_SHIFT      ( 0 )
#define TIMG_T0LOADHI_HI_MASK       ( 0x003FFFFF )
#define TIMG_T0LOADHI_HI_VALUE(raw) ( ((raw) & (TIMG_T0LOADHI_HI_MASK)) >> (TIMG_T0LOADHI_HI_SHIFT) )
#define TIMG_T0LOADHI_HI_RAW(value) ( (value) << (TIMG_T0LOADHI_HI_SHIFT) )

// TIMG_T0LOAD
#define TIMG_T0LOAD_DESC "Write to reload timer from TIMG_T0LOADLO_REG or TIMG_T0LOADHI_REG"

#ifndef __ASSEMBLY__

union timg_t0load {
	uint32_t raw;

	struct {
		uint32_t load : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_T0LOAD_LOAD_DESC       "Write any value to trigger a timer 0 time-base counter reload."
#define TIMG_T0LOAD_LOAD_SHIFT      ( 0 )
#define TIMG_T0LOAD_LOAD_MASK       ( 0xFFFFFFFF )
#define TIMG_T0LOAD_LOAD_VALUE(raw) ( ((raw) & (TIMG_T0LOAD_LOAD_MASK)) >> (TIMG_T0LOAD_LOAD_SHIFT) )
#define TIMG_T0LOAD_LOAD_RAW(value) ( (value) << (TIMG_T0LOAD_LOAD_SHIFT) )

// TIMG_WDTCONFIG0
#define TIMG_WDTCONFIG0_DESC "Watchdog timer configuration register"

#ifndef __ASSEMBLY__

union timg_wdtconfig0 {
	uint32_t raw;

	struct {
		uint32_t rsvd0            : 12;
		uint32_t appcpu_reset_en  : 1;
		uint32_t procpu_reset_en  : 1;
		uint32_t flashboot_mod_en : 1;
		uint32_t sys_reset_length : 3;
		uint32_t cpu_reset_length : 3;
		uint32_t rsvd1            : 1;
		uint32_t conf_update_en   : 1;
		uint32_t stg3             : 2;
		uint32_t stg2             : 2;
		uint32_t stg1             : 2;
		uint32_t stg0             : 2;
		uint32_t en               : 1;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTCONFIG0_APPCPU_RESET_EN_DESC       "Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_APPCPU_RESET_EN_SHIFT      ( 12 )
#define TIMG_WDTCONFIG0_APPCPU_RESET_EN_MASK       ( 0x00001000 )
#define TIMG_WDTCONFIG0_APPCPU_RESET_EN_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_APPCPU_RESET_EN_MASK)) >> (TIMG_WDTCONFIG0_APPCPU_RESET_EN_SHIFT) )
#define TIMG_WDTCONFIG0_APPCPU_RESET_EN_RAW(value) ( (value) << (TIMG_WDTCONFIG0_APPCPU_RESET_EN_SHIFT) )

#define TIMG_WDTCONFIG0_PROCPU_RESET_EN_DESC       "Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_PROCPU_RESET_EN_SHIFT      ( 13 )
#define TIMG_WDTCONFIG0_PROCPU_RESET_EN_MASK       ( 0x00002000 )
#define TIMG_WDTCONFIG0_PROCPU_RESET_EN_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_PROCPU_RESET_EN_MASK)) >> (TIMG_WDTCONFIG0_PROCPU_RESET_EN_SHIFT) )
#define TIMG_WDTCONFIG0_PROCPU_RESET_EN_RAW(value) ( (value) << (TIMG_WDTCONFIG0_PROCPU_RESET_EN_SHIFT) )

