lsbeatz/esp32c6-fw/drivers/timg/timg_regs.h
#define TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_DESC       "Configures whether to enable flash boot protection."
#define TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_SHIFT      ( 14 )
#define TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_MASK       ( 0x00004000 )
#define TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_MASK)) >> (TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_SHIFT) )
#define TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_RAW(value) ( (value) << (TIMG_WDTCONFIG0_FLASHBOOT_MOD_EN_SHIFT) )

#define TIMG_WDTCONFIG0_SYS_RESET_LENGTH_DESC       "Configures the system reset signal length. Valid only when write protection is disabled. Measurement unit: mwdt_clk."
#define TIMG_WDTCONFIG0_SYS_RESET_LENGTH_SHIFT      ( 15 )
#define TIMG_WDTCONFIG0_SYS_RESET_LENGTH_MASK       ( 0x00038000 )
#define TIMG_WDTCONFIG0_SYS_RESET_LENGTH_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_SYS_RESET_LENGTH_MASK)) >> (TIMG_WDTCONFIG0_SYS_RESET_LENGTH_SHIFT) )
#define TIMG_WDTCONFIG0_SYS_RESET_LENGTH_RAW(value) ( (value) << (TIMG_WDTCONFIG0_SYS_RESET_LENGTH_SHIFT) )

#define TIMG_WDTCONFIG0_CPU_RESET_LENGTH_DESC       "Configures the system reset signal length. Valid only when write protection is disabled. Measurement unit: mwdt_clk."
#define TIMG_WDTCONFIG0_CPU_RESET_LENGTH_SHIFT      ( 18 )
#define TIMG_WDTCONFIG0_CPU_RESET_LENGTH_MASK       ( 0x001C0000 )
#define TIMG_WDTCONFIG0_CPU_RESET_LENGTH_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_CPU_RESET_LENGTH_MASK)) >> (TIMG_WDTCONFIG0_CPU_RESET_LENGTH_SHIFT) )
#define TIMG_WDTCONFIG0_CPU_RESET_LENGTH_RAW(value) ( (value) << (TIMG_WDTCONFIG0_CPU_RESET_LENGTH_SHIFT) )

#define TIMG_WDTCONFIG0_CONF_UPDATE_EN_DESC       "Configures to update the WDT configuration registers."
#define TIMG_WDTCONFIG0_CONF_UPDATE_EN_SHIFT      ( 22 )
#define TIMG_WDTCONFIG0_CONF_UPDATE_EN_MASK       ( 0x00400000 )
#define TIMG_WDTCONFIG0_CONF_UPDATE_EN_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_CONF_UPDATE_EN_MASK)) >> (TIMG_WDTCONFIG0_CONF_UPDATE_EN_SHIFT) )
#define TIMG_WDTCONFIG0_CONF_UPDATE_EN_RAW(value) ( (value) << (TIMG_WDTCONFIG0_CONF_UPDATE_EN_SHIFT) )

#define TIMG_WDTCONFIG0_STG3_DESC       "Configures the timeout action of stage 3. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_STG3_SHIFT      ( 23 )
#define TIMG_WDTCONFIG0_STG3_MASK       ( 0x01800000 )
#define TIMG_WDTCONFIG0_STG3_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_STG3_MASK)) >> (TIMG_WDTCONFIG0_STG3_SHIFT) )
#define TIMG_WDTCONFIG0_STG3_RAW(value) ( (value) << (TIMG_WDTCONFIG0_STG3_SHIFT) )

#define TIMG_WDTCONFIG0_STG2_DESC       "Configures the timeout action of stage 2. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_STG2_SHIFT      ( 25 )
#define TIMG_WDTCONFIG0_STG2_MASK       ( 0x06000000 )
#define TIMG_WDTCONFIG0_STG2_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_STG2_MASK)) >> (TIMG_WDTCONFIG0_STG2_SHIFT) )
#define TIMG_WDTCONFIG0_STG2_RAW(value) ( (value) << (TIMG_WDTCONFIG0_STG2_SHIFT) )

#define TIMG_WDTCONFIG0_STG1_DESC       "Configures the timeout action of stage 1. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_STG1_SHIFT      ( 27 )
#define TIMG_WDTCONFIG0_STG1_MASK       ( 0x18000000 )
#define TIMG_WDTCONFIG0_STG1_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_STG1_MASK)) >> (TIMG_WDTCONFIG0_STG1_SHIFT) )
#define TIMG_WDTCONFIG0_STG1_RAW(value) ( (value) << (TIMG_WDTCONFIG0_STG1_SHIFT) )

#define TIMG_WDTCONFIG0_STG0_DESC       "Configures the timeout action of stage 0. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_STG0_SHIFT      ( 29 )
#define TIMG_WDTCONFIG0_STG0_MASK       ( 0x60000000 )
#define TIMG_WDTCONFIG0_STG0_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_STG0_MASK)) >> (TIMG_WDTCONFIG0_STG0_SHIFT) )
#define TIMG_WDTCONFIG0_STG0_RAW(value) ( (value) << (TIMG_WDTCONFIG0_STG0_SHIFT) )

#define TIMG_WDTCONFIG0_EN_DESC       "Configures whether or not to enable the MWDT. Valid only when write protection is disabled."
#define TIMG_WDTCONFIG0_EN_SHIFT      ( 31 )
#define TIMG_WDTCONFIG0_EN_MASK       ( 0x80000000 )
#define TIMG_WDTCONFIG0_EN_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG0_EN_MASK)) >> (TIMG_WDTCONFIG0_EN_SHIFT) )
#define TIMG_WDTCONFIG0_EN_RAW(value) ( (value) << (TIMG_WDTCONFIG0_EN_SHIFT) )

// TIMG_WDTCONFIG1
#define TIMG_WDTCONFIG1_DESC "Watchdog timer prescaler register"

#ifndef __ASSEMBLY__

union timg_wdtconfig1 {
	uint32_t raw;

	struct {
		uint32_t divcnt_rst   : 1;
		uint32_t rsvd0        : 15;
		uint32_t clk_prescale : 16;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTCONFIG1_DIVCNT_RST_DESC       "Configures whether to reset WDT’s clock divider counter."
#define TIMG_WDTCONFIG1_DIVCNT_RST_SHIFT      ( 0 )
#define TIMG_WDTCONFIG1_DIVCNT_RST_MASK       ( 0x00000001 )
#define TIMG_WDTCONFIG1_DIVCNT_RST_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG1_DIVCNT_RST_MASK)) >> (TIMG_WDTCONFIG1_DIVCNT_RST_SHIFT) )
#define TIMG_WDTCONFIG1_DIVCNT_RST_RAW(value) ( (value) << (TIMG_WDTCONFIG1_DIVCNT_RST_SHIFT) )

#define TIMG_WDTCONFIG1_CLK_PRESCALE_DESC       "Configures MWDT clock prescaler value. Valid only when write protection is disabled. MWDT clock period = MWDT’s clock source period * TIMG_WDT_CLK_PRESCALE."
#define TIMG_WDTCONFIG1_CLK_PRESCALE_SHIFT      ( 16 )
#define TIMG_WDTCONFIG1_CLK_PRESCALE_MASK       ( 0xFFFF0000 )
#define TIMG_WDTCONFIG1_CLK_PRESCALE_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG1_CLK_PRESCALE_MASK)) >> (TIMG_WDTCONFIG1_CLK_PRESCALE_SHIFT) )
#define TIMG_WDTCONFIG1_CLK_PRESCALE_RAW(value) ( (value) << (TIMG_WDTCONFIG1_CLK_PRESCALE_SHIFT) )

// TIMG_WDTCONFIG2
#define TIMG_WDTCONFIG2_DESC "Watchdog timer stage 0 timeout value"

#ifndef __ASSEMBLY__

union timg_wdtconfig2 {
	uint32_t raw;

	struct {
		uint32_t stg0_hold : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTCONFIG2_STG0_HOLD_DESC       "Configures the stage 0 timeout value. Valid only when write protection is disabled. Measurement unit: mwdt_clk."
#define TIMG_WDTCONFIG2_STG0_HOLD_SHIFT      ( 0 )
#define TIMG_WDTCONFIG2_STG0_HOLD_MASK       ( 0xFFFFFFFF )
#define TIMG_WDTCONFIG2_STG0_HOLD_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG2_STG0_HOLD_MASK)) >> (TIMG_WDTCONFIG2_STG0_HOLD_SHIFT) )
#define TIMG_WDTCONFIG2_STG0_HOLD_RAW(value) ( (value) << (TIMG_WDTCONFIG2_STG0_HOLD_SHIFT) )

// TIMG_WDTCONFIG3
#define TIMG_WDTCONFIG3_DESC "Watchdog timer stage 1 timeout value"

