lsbeatz/esp32c6-fw/drivers/timg/timg_regs.h
#ifndef __ASSEMBLY__

union timg_wdtconfig3 {
	uint32_t raw;

	struct {
		uint32_t stg1_hold : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTCONFIG3_STG1_HOLD_DESC       "Configures the stage 1 timeout value. Valid only when write protection is disabled. Measurement unit: mwdt_clk."
#define TIMG_WDTCONFIG3_STG1_HOLD_SHIFT      ( 0 )
#define TIMG_WDTCONFIG3_STG1_HOLD_MASK       ( 0xFFFFFFFF )
#define TIMG_WDTCONFIG3_STG1_HOLD_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG3_STG1_HOLD_MASK)) >> (TIMG_WDTCONFIG3_STG1_HOLD_SHIFT) )
#define TIMG_WDTCONFIG3_STG1_HOLD_RAW(value) ( (value) << (TIMG_WDTCONFIG3_STG1_HOLD_SHIFT) )

// TIMG_WDTCONFIG4
#define TIMG_WDTCONFIG4_DESC "Watchdog timer stage 2 timeout value"

#ifndef __ASSEMBLY__

union timg_wdtconfig4 {
	uint32_t raw;

	struct {
		uint32_t stg2_hold : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTCONFIG4_STG2_HOLD_DESC       "Configures the stage 2 timeout value. Valid only when write protection is disabled. Measurement unit: mwdt_clk."
#define TIMG_WDTCONFIG4_STG2_HOLD_SHIFT      ( 0 )
#define TIMG_WDTCONFIG4_STG2_HOLD_MASK       ( 0xFFFFFFFF )
#define TIMG_WDTCONFIG4_STG2_HOLD_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG4_STG2_HOLD_MASK)) >> (TIMG_WDTCONFIG4_STG2_HOLD_SHIFT) )
#define TIMG_WDTCONFIG4_STG2_HOLD_RAW(value) ( (value) << (TIMG_WDTCONFIG4_STG2_HOLD_SHIFT) )

// TIMG_WDTCONFIG5
#define TIMG_WDTCONFIG5_DESC "Watchdog timer stage 3 timeout value"

#ifndef __ASSEMBLY__

union timg_wdtconfig5 {
	uint32_t raw;

	struct {
		uint32_t stg3_hold : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTCONFIG5_STG3_HOLD_DESC       "Configures the stage 3 timeout value. Valid only when write protection is disabled. Measurement unit: mwdt_clk."
#define TIMG_WDTCONFIG5_STG3_HOLD_SHIFT      ( 0 )
#define TIMG_WDTCONFIG5_STG3_HOLD_MASK       ( 0xFFFFFFFF )
#define TIMG_WDTCONFIG5_STG3_HOLD_VALUE(raw) ( ((raw) & (TIMG_WDTCONFIG5_STG3_HOLD_MASK)) >> (TIMG_WDTCONFIG5_STG3_HOLD_SHIFT) )
#define TIMG_WDTCONFIG5_STG3_HOLD_RAW(value) ( (value) << (TIMG_WDTCONFIG5_STG3_HOLD_SHIFT) )

// TIMG_WDTFEED
#define TIMG_WDTFEED_DESC "Write to feed the watchdog timer"

#ifndef __ASSEMBLY__

union timg_wdtfeed {
	uint32_t raw;

	struct {
		uint32_t feed : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTFEED_FEED_DESC       "Write any value to feed the MWDT. Valid only when write protection is disabled."
#define TIMG_WDTFEED_FEED_SHIFT      ( 0 )
#define TIMG_WDTFEED_FEED_MASK       ( 0xFFFFFFFF )
#define TIMG_WDTFEED_FEED_VALUE(raw) ( ((raw) & (TIMG_WDTFEED_FEED_MASK)) >> (TIMG_WDTFEED_FEED_SHIFT) )
#define TIMG_WDTFEED_FEED_RAW(value) ( (value) << (TIMG_WDTFEED_FEED_SHIFT) )

// TIMG_WDTWPROTECT
#define TIMG_WDTWPROTECT_DESC "Watchdog write protect register"

#ifndef __ASSEMBLY__

union timg_wdtwprotect {
	uint32_t raw;

	struct {
		uint32_t wkey : 32;
	};
};

#endif // __ASSEMBLY__

#define TIMG_WDTWPROTECT_WKEY_DESC       "Configures a different value than its reset value to enable write protection."
#define TIMG_WDTWPROTECT_WKEY_SHIFT      ( 0 )
#define TIMG_WDTWPROTECT_WKEY_MASK       ( 0xFFFFFFFF )
#define TIMG_WDTWPROTECT_WKEY_VALUE(raw) ( ((raw) & (TIMG_WDTWPROTECT_WKEY_MASK)) >> (TIMG_WDTWPROTECT_WKEY_SHIFT) )
#define TIMG_WDTWPROTECT_WKEY_RAW(value) ( (value) << (TIMG_WDTWPROTECT_WKEY_SHIFT) )

// TIMG_RTCCALICFG0
#define TIMG_RTCCALICFG0_DESC "RTC frequency calculation configuration register 0"

#ifndef __ASSEMBLY__

union timg_rtccalicfg0 {
	uint32_t raw;

	struct {
		uint32_t rsvd0         : 12;
		uint32_t start_cycling : 1;
		uint32_t clk_sel       : 2;
		uint32_t rdy           : 1;
		uint32_t max           : 15;
		uint32_t start         : 1;
	};
};

#endif // __ASSEMBLY__

#define TIMG_RTCCALICFG0_START_CYCLING_DESC       "Configures the frequency calculation mode."
#define TIMG_RTCCALICFG0_START_CYCLING_SHIFT      ( 12 )
#define TIMG_RTCCALICFG0_START_CYCLING_MASK       ( 0x00001000 )
#define TIMG_RTCCALICFG0_START_CYCLING_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG0_START_CYCLING_MASK)) >> (TIMG_RTCCALICFG0_START_CYCLING_SHIFT) )
#define TIMG_RTCCALICFG0_START_CYCLING_RAW(value) ( (value) << (TIMG_RTCCALICFG0_START_CYCLING_SHIFT) )

#define TIMG_RTCCALICFG0_CLK_SEL_DESC       "Configures to select the clock to be calibrated"
#define TIMG_RTCCALICFG0_CLK_SEL_SHIFT      ( 13 )
#define TIMG_RTCCALICFG0_CLK_SEL_MASK       ( 0x00006000 )
#define TIMG_RTCCALICFG0_CLK_SEL_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG0_CLK_SEL_MASK)) >> (TIMG_RTCCALICFG0_CLK_SEL_SHIFT) )
#define TIMG_RTCCALICFG0_CLK_SEL_RAW(value) ( (value) << (TIMG_RTCCALICFG0_CLK_SEL_SHIFT) )

#define TIMG_RTCCALICFG0_RDY_DESC       "Represents whether one-shot frequency calculation is done."
#define TIMG_RTCCALICFG0_RDY_SHIFT      ( 15 )
#define TIMG_RTCCALICFG0_RDY_MASK       ( 0x00008000 )
#define TIMG_RTCCALICFG0_RDY_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG0_RDY_MASK)) >> (TIMG_RTCCALICFG0_RDY_SHIFT) )
#define TIMG_RTCCALICFG0_RDY_RAW(value) ( (value) << (TIMG_RTCCALICFG0_RDY_SHIFT) )

#define TIMG_RTCCALICFG0_MAX_DESC       "Configures the time to calculate RTC slow clock’s frequency. Measurement unit: XTAL_CLK."
#define TIMG_RTCCALICFG0_MAX_SHIFT      ( 16 )
#define TIMG_RTCCALICFG0_MAX_MASK       ( 0x7FFF0000 )
#define TIMG_RTCCALICFG0_MAX_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG0_MAX_MASK)) >> (TIMG_RTCCALICFG0_MAX_SHIFT) )
#define TIMG_RTCCALICFG0_MAX_RAW(value) ( (value) << (TIMG_RTCCALICFG0_MAX_SHIFT) )

#define TIMG_RTCCALICFG0_START_DESC       "Configures whether to enable one-shot frequency calculation."
#define TIMG_RTCCALICFG0_START_SHIFT      ( 31 )
#define TIMG_RTCCALICFG0_START_MASK       ( 0x80000000 )
#define TIMG_RTCCALICFG0_START_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG0_START_MASK)) >> (TIMG_RTCCALICFG0_START_SHIFT) )
#define TIMG_RTCCALICFG0_START_RAW(value) ( (value) << (TIMG_RTCCALICFG0_START_SHIFT) )

// TIMG_RTCCALICFG1
#define TIMG_RTCCALICFG1_DESC "RTC frequency calculation configuration register 1"

#ifndef __ASSEMBLY__

union timg_rtccalicfg1 {
	uint32_t raw;

	struct {
		uint32_t cycling_data_vld : 1;
		uint32_t rsvd0            : 6;
		uint32_t value            : 25;
	};
};

#endif // __ASSEMBLY__

#define TIMG_RTCCALICFG1_CYCLING_DATA_VLD_DESC       "Represents whether periodic frequency calculation is done."
#define TIMG_RTCCALICFG1_CYCLING_DATA_VLD_SHIFT      ( 0 )
#define TIMG_RTCCALICFG1_CYCLING_DATA_VLD_MASK       ( 0x00000001 )
#define TIMG_RTCCALICFG1_CYCLING_DATA_VLD_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG1_CYCLING_DATA_VLD_MASK)) >> (TIMG_RTCCALICFG1_CYCLING_DATA_VLD_SHIFT) )
#define TIMG_RTCCALICFG1_CYCLING_DATA_VLD_RAW(value) ( (value) << (TIMG_RTCCALICFG1_CYCLING_DATA_VLD_SHIFT) )

#define TIMG_RTCCALICFG1_VALUE_DESC       "Represents the value countered by XTAL_CLK when one-shot or periodic frequency calculation is done. It is used to calculate RTC slow clock’s frequency."
#define TIMG_RTCCALICFG1_VALUE_SHIFT      ( 7 )
#define TIMG_RTCCALICFG1_VALUE_MASK       ( 0xFFFFFF80 )
#define TIMG_RTCCALICFG1_VALUE_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG1_VALUE_MASK)) >> (TIMG_RTCCALICFG1_VALUE_SHIFT) )
#define TIMG_RTCCALICFG1_VALUE_RAW(value) ( (value) << (TIMG_RTCCALICFG1_VALUE_SHIFT) )

