lsbeatz/esp32c6-fw/drivers/timg/timg_regs.h
// TIMG_RTCCALICFG2
#define TIMG_RTCCALICFG2_DESC "RTC frequency calculation configuration register 2"

#ifndef __ASSEMBLY__

union timg_rtccalicfg2 {
	uint32_t raw;

	struct {
		uint32_t timeout         : 1;
		uint32_t rsvd0           : 2;
		uint32_t timeout_rst_cnt : 4;
		uint32_t timeout_thres   : 25;
	};
};

#endif // __ASSEMBLY__

#define TIMG_RTCCALICFG2_TIMEOUT_DESC       "Represents whether RTC frequency calculation is timeout."
#define TIMG_RTCCALICFG2_TIMEOUT_SHIFT      ( 0 )
#define TIMG_RTCCALICFG2_TIMEOUT_MASK       ( 0x00000001 )
#define TIMG_RTCCALICFG2_TIMEOUT_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG2_TIMEOUT_MASK)) >> (TIMG_RTCCALICFG2_TIMEOUT_SHIFT) )
#define TIMG_RTCCALICFG2_TIMEOUT_RAW(value) ( (value) << (TIMG_RTCCALICFG2_TIMEOUT_SHIFT) )

#define TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_DESC       "Configures the cycles that reset frequency calculation timeout."
#define TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_SHIFT      ( 3 )
#define TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_MASK       ( 0x00000078 )
#define TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_MASK)) >> (TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_SHIFT) )
#define TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_RAW(value) ( (value) << (TIMG_RTCCALICFG2_TIMEOUT_RST_CNT_SHIFT) )

#define TIMG_RTCCALICFG2_TIMEOUT_THRES_DESC       "Configures the threshold value for the RTC frequency calculation timer. If the timer’s value exceeds this threshold, a timeout is triggered. Measurement unit: XTAL_CLK."
#define TIMG_RTCCALICFG2_TIMEOUT_THRES_SHIFT      ( 7 )
#define TIMG_RTCCALICFG2_TIMEOUT_THRES_MASK       ( 0xFFFFFF80 )
#define TIMG_RTCCALICFG2_TIMEOUT_THRES_VALUE(raw) ( ((raw) & (TIMG_RTCCALICFG2_TIMEOUT_THRES_MASK)) >> (TIMG_RTCCALICFG2_TIMEOUT_THRES_SHIFT) )
#define TIMG_RTCCALICFG2_TIMEOUT_THRES_RAW(value) ( (value) << (TIMG_RTCCALICFG2_TIMEOUT_THRES_SHIFT) )

// TIMG_INT_ENA_TIMERS
#define TIMG_INT_ENA_TIMERS_DESC "Interrupt enable bits"

#ifndef __ASSEMBLY__

union timg_int_ena_timers {
	uint32_t raw;

	struct {
		uint32_t t0    : 1;
		uint32_t wdt   : 1;
		uint32_t rsvd0 : 30;
	};
};

#endif // __ASSEMBLY__

#define TIMG_INT_ENA_TIMERS_T0_DESC       "Write 1 to enable the TIMG_T0_INT interrupt."
#define TIMG_INT_ENA_TIMERS_T0_SHIFT      ( 0 )
#define TIMG_INT_ENA_TIMERS_T0_MASK       ( 0x00000001 )
#define TIMG_INT_ENA_TIMERS_T0_VALUE(raw) ( ((raw) & (TIMG_INT_ENA_TIMERS_T0_MASK)) >> (TIMG_INT_ENA_TIMERS_T0_SHIFT) )
#define TIMG_INT_ENA_TIMERS_T0_RAW(value) ( (value) << (TIMG_INT_ENA_TIMERS_T0_SHIFT) )

#define TIMG_INT_ENA_TIMERS_WDT_DESC       "Write 1 to enable the TIMG_WDT_INT interrupt."
#define TIMG_INT_ENA_TIMERS_WDT_SHIFT      ( 1 )
#define TIMG_INT_ENA_TIMERS_WDT_MASK       ( 0x00000002 )
#define TIMG_INT_ENA_TIMERS_WDT_VALUE(raw) ( ((raw) & (TIMG_INT_ENA_TIMERS_WDT_MASK)) >> (TIMG_INT_ENA_TIMERS_WDT_SHIFT) )
#define TIMG_INT_ENA_TIMERS_WDT_RAW(value) ( (value) << (TIMG_INT_ENA_TIMERS_WDT_SHIFT) )

// TIMG_INT_RAW_TIMERS
#define TIMG_INT_RAW_TIMERS_DESC "Raw interrupt status"

#ifndef __ASSEMBLY__

union timg_int_raw_timers {
	uint32_t raw;

	struct {
		uint32_t t0    : 1;
		uint32_t wdt   : 1;
		uint32_t rsvd0 : 30;
	};
};

#endif // __ASSEMBLY__

#define TIMG_INT_RAW_TIMERS_T0_DESC       "The raw interrupt status bit of the TIMG_T0_INT interrupt."
#define TIMG_INT_RAW_TIMERS_T0_SHIFT      ( 0 )
#define TIMG_INT_RAW_TIMERS_T0_MASK       ( 0x00000001 )
#define TIMG_INT_RAW_TIMERS_T0_VALUE(raw) ( ((raw) & (TIMG_INT_RAW_TIMERS_T0_MASK)) >> (TIMG_INT_RAW_TIMERS_T0_SHIFT) )
#define TIMG_INT_RAW_TIMERS_T0_RAW(value) ( (value) << (TIMG_INT_RAW_TIMERS_T0_SHIFT) )

#define TIMG_INT_RAW_TIMERS_WDT_DESC       "The raw interrupt status bit of the TIMG_WDT_INT interrupt."
#define TIMG_INT_RAW_TIMERS_WDT_SHIFT      ( 1 )
#define TIMG_INT_RAW_TIMERS_WDT_MASK       ( 0x00000002 )
#define TIMG_INT_RAW_TIMERS_WDT_VALUE(raw) ( ((raw) & (TIMG_INT_RAW_TIMERS_WDT_MASK)) >> (TIMG_INT_RAW_TIMERS_WDT_SHIFT) )
#define TIMG_INT_RAW_TIMERS_WDT_RAW(value) ( (value) << (TIMG_INT_RAW_TIMERS_WDT_SHIFT) )

// TIMG_INT_ST_TIMERS
#define TIMG_INT_ST_TIMERS_DESC "Masked interrupt status"

#ifndef __ASSEMBLY__

union timg_int_st_timers {
	uint32_t raw;

	struct {
		uint32_t t0    : 1;
		uint32_t wdt   : 1;
		uint32_t rsvd0 : 30;
	};
};

#endif // __ASSEMBLY__

#define TIMG_INT_ST_TIMERS_T0_DESC       "The masked interrupt status bit of the TIMG_T0_INT interrupt."
#define TIMG_INT_ST_TIMERS_T0_SHIFT      ( 0 )
#define TIMG_INT_ST_TIMERS_T0_MASK       ( 0x00000001 )
#define TIMG_INT_ST_TIMERS_T0_VALUE(raw) ( ((raw) & (TIMG_INT_ST_TIMERS_T0_MASK)) >> (TIMG_INT_ST_TIMERS_T0_SHIFT) )
#define TIMG_INT_ST_TIMERS_T0_RAW(value) ( (value) << (TIMG_INT_ST_TIMERS_T0_SHIFT) )

#define TIMG_INT_ST_TIMERS_WDT_DESC       "The masked interrupt status bit of the TIMG_WDT_INT interrupt."
#define TIMG_INT_ST_TIMERS_WDT_SHIFT      ( 1 )
#define TIMG_INT_ST_TIMERS_WDT_MASK       ( 0x00000002 )
#define TIMG_INT_ST_TIMERS_WDT_VALUE(raw) ( ((raw) & (TIMG_INT_ST_TIMERS_WDT_MASK)) >> (TIMG_INT_ST_TIMERS_WDT_SHIFT) )
#define TIMG_INT_ST_TIMERS_WDT_RAW(value) ( (value) << (TIMG_INT_ST_TIMERS_WDT_SHIFT) )

// TIMG_INT_CLR_TIMERS
#define TIMG_INT_CLR_TIMERS_DESC "Interrupt clear bits"

#ifndef __ASSEMBLY__

union timg_int_clr_timers {
	uint32_t raw;

	struct {
		uint32_t t0    : 1;
		uint32_t wdt   : 1;
		uint32_t rsvd0 : 30;
	};
};

#endif // __ASSEMBLY__

#define TIMG_INT_CLR_TIMERS_T0_DESC       "Write 1 to clear the TIMG_T0_INT interrupt."
#define TIMG_INT_CLR_TIMERS_T0_SHIFT      ( 0 )
#define TIMG_INT_CLR_TIMERS_T0_MASK       ( 0x00000001 )
#define TIMG_INT_CLR_TIMERS_T0_VALUE(raw) ( ((raw) & (TIMG_INT_CLR_TIMERS_T0_MASK)) >> (TIMG_INT_CLR_TIMERS_T0_SHIFT) )
#define TIMG_INT_CLR_TIMERS_T0_RAW(value) ( (value) << (TIMG_INT_CLR_TIMERS_T0_SHIFT) )

#define TIMG_INT_CLR_TIMERS_WDT_DESC       "Write 1 to clear the TIMG_WDT_INT interrupt."
#define TIMG_INT_CLR_TIMERS_WDT_SHIFT      ( 1 )
#define TIMG_INT_CLR_TIMERS_WDT_MASK       ( 0x00000002 )
#define TIMG_INT_CLR_TIMERS_WDT_VALUE(raw) ( ((raw) & (TIMG_INT_CLR_TIMERS_WDT_MASK)) >> (TIMG_INT_CLR_TIMERS_WDT_SHIFT) )
#define TIMG_INT_CLR_TIMERS_WDT_RAW(value) ( (value) << (TIMG_INT_CLR_TIMERS_WDT_SHIFT) )

// TIMG_NTIMERS_DATE
#define TIMG_NTIMERS_DATE_DESC "Timer version control register"

