lsbeatz/esp32c6-fw/drivers/timg/timg_regs.h
#ifndef __ASSEMBLY__

union timg_ntimers_date {
	uint32_t raw;

	struct {
		uint32_t date  : 28;
		uint32_t rsvd0 : 4;
	};
};

#endif // __ASSEMBLY__

#define TIMG_NTIMERS_DATE_DATE_DESC       "Version control register"
#define TIMG_NTIMERS_DATE_DATE_SHIFT      ( 0 )
#define TIMG_NTIMERS_DATE_DATE_MASK       ( 0x0FFFFFFF )
#define TIMG_NTIMERS_DATE_DATE_VALUE(raw) ( ((raw) & (TIMG_NTIMERS_DATE_DATE_MASK)) >> (TIMG_NTIMERS_DATE_DATE_SHIFT) )
#define TIMG_NTIMERS_DATE_DATE_RAW(value) ( (value) << (TIMG_NTIMERS_DATE_DATE_SHIFT) )

// TIMG_REGCLK
#define TIMG_REGCLK_DESC "Timer group clock gate register"

#ifndef __ASSEMBLY__

union timg_regclk {
	uint32_t raw;

	struct {
		uint32_t rsvd0               : 28;
		uint32_t etm_en              : 1;
		uint32_t wdt_clk_is_active   : 1;
		uint32_t timer_clk_is_active : 1;
		uint32_t clk_en              : 1;
	};
};

#endif // __ASSEMBLY__

#define TIMG_REGCLK_ETM_EN_DESC       "Configures whether to enable timer’s ETM task and event."
#define TIMG_REGCLK_ETM_EN_SHIFT      ( 28 )
#define TIMG_REGCLK_ETM_EN_MASK       ( 0x10000000 )
#define TIMG_REGCLK_ETM_EN_VALUE(raw) ( ((raw) & (TIMG_REGCLK_ETM_EN_MASK)) >> (TIMG_REGCLK_ETM_EN_SHIFT) )
#define TIMG_REGCLK_ETM_EN_RAW(value) ( (value) << (TIMG_REGCLK_ETM_EN_SHIFT) )

#define TIMG_REGCLK_WDT_CLK_IS_ACTIVE_DESC       "Configures whether to enable WDT’s clock"
#define TIMG_REGCLK_WDT_CLK_IS_ACTIVE_SHIFT      ( 29 )
#define TIMG_REGCLK_WDT_CLK_IS_ACTIVE_MASK       ( 0x20000000 )
#define TIMG_REGCLK_WDT_CLK_IS_ACTIVE_VALUE(raw) ( ((raw) & (TIMG_REGCLK_WDT_CLK_IS_ACTIVE_MASK)) >> (TIMG_REGCLK_WDT_CLK_IS_ACTIVE_SHIFT) )
#define TIMG_REGCLK_WDT_CLK_IS_ACTIVE_RAW(value) ( (value) << (TIMG_REGCLK_WDT_CLK_IS_ACTIVE_SHIFT) )

#define TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_DESC       "Configures whether to enable TIMER0`s clock"
#define TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_SHIFT      ( 30 )
#define TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_MASK       ( 0x40000000 )
#define TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_VALUE(raw) ( ((raw) & (TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_MASK)) >> (TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_SHIFT) )
#define TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_RAW(value) ( (value) << (TIMG_REGCLK_TIMER_CLK_IS_ACTIVE_SHIFT) )

#define TIMG_REGCLK_CLK_EN_DESC       "Configures whether to enable gate clock signal for registers."
#define TIMG_REGCLK_CLK_EN_SHIFT      ( 31 )
#define TIMG_REGCLK_CLK_EN_MASK       ( 0x80000000 )
#define TIMG_REGCLK_CLK_EN_VALUE(raw) ( ((raw) & (TIMG_REGCLK_CLK_EN_MASK)) >> (TIMG_REGCLK_CLK_EN_SHIFT) )
#define TIMG_REGCLK_CLK_EN_RAW(value) ( (value) << (TIMG_REGCLK_CLK_EN_SHIFT) )

/* clang-format on */

#endif // TIMG_REGS_H
